Tekla.Structures.TeklaStructuresInternal.ICDelegate


Tekla.Structures.TeklaStructuresInternal.ICDelegate.ExportGetCurrentProgramVersion(Tekla.Structures.Internal.dotProgramVersion_t@)
pProgramVersion:
Returns:

Tekla.Structures.TeklaStructuresInternal.ICDelegate.ExportGetCurrentUser(System.String@)
user:
Returns:

Tekla.Structures.TeklaStructuresInternal.ICDelegate.ExportGetAdvancedOption(Tekla.Structures.Internal.dotGetAdvancedOption_t@)
pArgument:
Returns:

Tekla.Structures.TeklaStructuresInternal.ICDelegate.ExportGetToolOptionValue(System.String@)
toolOptionName:
Returns:

Tekla.Structures.TeklaStructuresInternal.ICDelegate.ExportGetSetClashCheckOptions(Tekla.Structures.Internal.dotClashCheckOptions_t@)
pArgument:
Returns:

Tekla.Structures.TeklaStructuresInternal.ICDelegate.ExportGetSetComponentOptions(Tekla.Structures.Internal.dotComponentOptions_t@)
pArgument:
Returns:

Tekla.Structures.TeklaStructuresInternal.ICDelegate.ExportFeatureSupportHandler(Tekla.Structures.TeklaStructuresInternal.dotFeatureSupportHandler_t@)
pArgument:
Returns:

Tekla.Structures.TeklaStructuresInternal.ICDelegate.ExportTestingFeaturesHandler(Tekla.Structures.TeklaStructuresInternal.dotTestingFeaturesHandler_t@)
pArgument:
Returns:

Tekla.Structures.TeklaStructuresInternal.ICDelegate.ExportGetModuleQuery(Tekla.Structures.Internal.dotModuleManagerQuery_t@)
DO NOT USE! For internal usage only!
pModuleQuery:
Returns:

Tekla.Structures.TeklaStructuresInternal.ICDelegate.ExportGetAnalysisModuleQuery(Tekla.Structures.Internal.DotAnalysisModuleManagerQuery@)
DO NOT USE! For internal usage only!
pModuleQuery:
Returns: Returns the modules in use.

Tekla.Structures.TeklaStructuresInternal.ICDelegate.ExportGetIdentifierByGUID(Tekla.Structures.Internal.dotIdentifierToGUID_t@)
DO NOT USE! For internal usage only!
pIdentifierToGUID:
Returns:

Tekla.Structures.TeklaStructuresInternal.ICDelegate.ExportGetAttributeFile(Tekla.Structures.TeklaStructuresInternal.dotGetAttributeFile_t@)
DO NOT USE! For internal usage only!
data: The Data.
Returns: True if file was found.